Revit 2024 API
SpecTypeId.PointSpringCoefficient Property
 Point Spring Coefficient, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId PointSpringCoefficient { get; }
Visual Basic
Public Shared ReadOnly Property PointSpringCoefficient As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PointSpringCoefficient {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace